<?php
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//			Печенки
//
// * - удалить все
// 40 - добавить товар id = 40
// -40 - удалить товар id = 40
// f_name - предали имя формы
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

function set_test_cookie( ) {

	// Извлечь действие
	$uid = pull_test_data( $_GET[ 'uid' ], ['0-9*-'] );
	
	// Извлечь количество товара
	$basket_length =	pull_test_data( $_COOKIE[ 'basket' ][ 'length' ], true ) ? 
					pull_test_data( $_COOKIE[ 'basket' ][ 'length' ], 123 ) : 
					0;
	// Извлечь список
	$basket_str = pull_test_data( $_COOKIE[ 'basket' ][ 'string' ] );
	
	// Извлечь имя формы
	$retrieved_event_data = pull_test_data( $_GET[ "f_name" ], true );
	
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// Если удалить все
	if ( $uid === '*' ) {

		// Внесем в массив на сервере
		$_COOKIE[ 'basket' ][ 'length' ] = '';
		$_COOKIE[ 'basket' ][ 'string' ] = '';

		// Внесем в массив на клиенте
		setcookie( 'basket[length]', '', 0, '/' );
		setcookie( 'basket[string]', '', 0, '/' );
		
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// Если добавить товар
	} elseif ( intval( $uid ) > 0 ) {
	
		// Добавим товар
		$basket_str .= $uid . '+';

		// Внесем в массив на сервере
		$_COOKIE[ 'basket' ][ 'length' ] = $basket_length + 1;
		$_COOKIE[ 'basket' ][ 'string' ] = $basket_str;

		// Внесем в массив на клиенте
		setcookie( 'basket[length]', $basket_length + 1, 0, '/' );
		setcookie( 'basket[string]', $basket_str, 0, '/' );
		
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// Если убрать товар	
	} elseif ( intval( $uid ) < 0 ) {

		// Разобьем строку в массив
		$arr = explode( "+", $basket_str );
	
		// Ид товара
		$uid = substr( $uid, 1 );
	
		// Пробежим по массиву
		foreach ( $arr as $key => $value ) {
		
			if ( $arr[ $key ] == $uid ) { 
		
				// Удалим только один элемент
				unset( $arr[ $key ] );
			
				break;
			
			};
		};
	
		// Переиндексируем
		$arr = array_values( $arr );	
	
		// Соберем в строку
		$basket_str = implode( "+", $arr );

		// Внесем в массив на сервере
		$_COOKIE[ 'basket' ][ 'length' ] = $basket_length - 1;
		$_COOKIE[ 'basket' ][ 'string' ] = $basket_str;

		// Внесем в массив на клиенте
		setcookie( 'basket[length]', $basket_length - 1, 0, '/' );
		setcookie( 'basket[string]', $basket_str, 0, '/' );	
		
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// Если предали имя формы
	} elseif ( $retrieved_event_data ) {
	
		// Попробуем обработать форму
		$result = pull_test_form( [ "name" => "", "phone" => "", "email" => "" ] );
		
		// Данные ок
		if ( is_null ( $result[ "warning" ] ) ) {
		
			// Внесем в массив на клиенте
			setcookie( 'basket[length]', '', 0, '/' );
			setcookie( 'basket[string]', '', 0, '/' );
		
		};
		
	};
};

?>


