<?php
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Конструктор таблиц.
//
// get_test_table( $args ) - возвращает таблицу ( string )
// _build_test_line( $data, $head ) вспомогательная строит строку, если head=true то заголовок
// _build_test_array( $data, $head ) вспомогательная разбирает подмассивы, если head=true то заголовок
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 
// Примеры:
//
// 1. таблица три на три, верхняя строчка заголовок и две строки, второй и третий столбцы объединины
// c ид tabl завернута в div:
//
// get_test_table( ["before"	=> "<div>",
//				"after"	=> "</div>",
//				"classID"	=> "#tabl",
//				"head"	=> ['headrow 1','headrow 2,3',null],
//				"body"	=> 	[
//							['bodyrow 1','bodyrow 2,3',null],
//							['bodyrow 1','bodyrow 2,3',null],
//							],
//				] );
//	null - объединяет ячейки с предведущим значением.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	Конструктор линии.		//
//	вспомогательная функция	//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
function _build_test_line( $data = null, $head = false ) {

	// Не массив или пустой, расходимся..
	if ( ! $data || ! is_array( $data ) ) { return; };
	
	$result = '';
	
	// Это заголовок?
	if ( $head ) {
	
		$result .= '<thead ';
				
		// Ключь имеет название? тогда пропишем класс линии
		if ( $key && is_string( $key ) ) {
				
			$result .= 'class="' . $key . '" ';
					
		};
				
	// Это тело!
	} else {
	
		$result .= '<tbody ';
				
		// Ключь имеет название? тогда пропишем класс линии
		if ( $key && is_string( $key ) ) {
				
			$result .= 'class="' . $key . '" ';
		};

	};
	
	// Откроем строку
	$result .= '><tr>';
	
	// Перевернем строку что-бы посчитать колспан	
	$line = array_reverse( $data );
		
	$colspan = 1;
		
	$i = 0;
	
	// Пройдем по массиву
	foreach ( $line as $key => $value ) {
		
		// Если значение имеет смысл, не null
		if (	! is_null( $value ) ) {
		
			// Это заголовок?
		 	if ( $head ) {
	
				$str = '<th ';
				
			// Это тело!
			} else {
	
				$str = '<td ';
	
			};
			
			// Ключь имеет название? тогда пропишем класс ячейки
			if ( $key && is_string( $key ) ) {
				
				$str .= 'class="' . $key . '" ';
					
			};
			
			// Колспан больше единицы? объединим строки..
			if ( $colspan > 1 ) {
				
				$str .= 'colspan="' . $colspan . '" ';
					
			};
			
			// Содержимое ячейки..
			$str .= '>' . $value;
			
			// Это заголовок?
			if ( $head ) {
	
				$str .= '</th>';
		
			// Это тело!
			} else {
	
				$str .= '</td>';
	
			};
			
			// Сохраним ячейки в массив	
			$arr[ $i ] = $str;
			
			// Сбросим колспан
			$colspan = 1;
		
		// Значение ячейки null || ''
		} else {
			
			// Плюсанем колспан
			$colspan++;
				
		};
			
		$i++;
						
	};
	
	// Перевернем строку что-бы вывести		
	$arr = array_reverse( $arr );
		
	// Пройдем по массиву
	foreach ( $arr as $key => $value ) {
				
		$result .= $arr[ $key ];
	};
	
	// Закроем строку
	$result .= '</tr>';
	
	// Это заголовок?
	if ( $head ) {
	
		$result .= '</thead>';
		
	// Это тело!
	} else {
	
		$result .= '</tbody>';

	};
	
	return $result;

};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	Разбор массива.		//
//	вспомогательная функция	//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
function _build_test_array( $data = null, $head = false ) {

	// Не массив или пустой, расходимся..
	if ( ! $data || ! is_array( $data ) ) { return; };

	$result = '';
	$_array = false;
	
	// Пройдем по массиву
	foreach ( $data as $key => $value ) {
	
		// Есть вложения
		if ( is_array( $value ) ) {
		
			$_array = true;
			
			// реккурсивно!
			$result .= _build_test_array( $value, $head );
			
		};
	};
	
	// Нет вложений
	if ( ! $_array ) {
	
		// Отправим формировать строки
		$result .= _build_test_line( $data, $head );
		
	};
			
	return $result;
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	Конструктор таблицы.	//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
function get_test_table( $args = null ) {
	$defaults = [
		"before"	=>	null,	// "<p>"
		"classID"	=>	null,	// "class" или "#id"
		"title"	=>	null,	// "дефолтная табличка"
		"after"	=>	null,	// "</p>"
		"head"	=>	null,	// [ 'class'=>'заголовок',null,null, 'заголовок' ]
		"body"	=>	null,	// [ 'class'=>'содержимое',null,null, 'содержимое' ]
	];

	// Распарсим аргументы
	$key = wp_parse_args( $args, $defaults );
	
	$table = '';
	$atribute = '';
	
	// Есть head || body? 
	if ( $key[ "head" ] || $key[ "body" ] ) {
	
		// Не массивы, расходимся..
		if ( ! ( is_array( $key[ "head" ] ) || is_array( $key[ "body" ] ) ) ) { return; };
		
	// Нет содержимого, расходимся..
	} else { return; };
	
	// До таблички например '<div class="bind">'
	if ( $key[ "before" ] && is_string( $key[ "before" ] ) ) {
	
		$table .= $key[ "before" ];
		
	};
	
	// Класс или ид например '#table' - ид || 'table' - класс
	if ( $key[ "classID" ] && is_string( $key[ "classID" ] ) ) {
	
		if ( $key[ "classID" ][ 0 ] === "#" ) {
		
			$atribute .= 'id="' . substr( $key[ "classID" ], 1 ) . '" ';

		} else {
		
			$atribute .= 'class="' . $key[ "classID" ] . '" ';

		};
	};
	
	// Титл например 'Табличка какая-то..'
	if ( $key[ "title" ] && is_string( $key[ "title" ] ) ) {
	
		$atribute .= 'title="' . $key[ "title" ] . '" ';
		
	};
	
	$table .= '<table ' . $atribute . '>';
	
	// Заголовки ( array ( array ) )
	//
	// Например:
	//
	// ['1 колонка','','',''] колонка и три пустых
	// 
	// ['4 колонки',null,null,null]
	//
	// ['3 колонки',null,null,'1 колонка']
	//
	// [ ['4 колонки',null,null,null],  ['4 колонки',null,null,null] ]
	//
	// Или с классом:
	//
	// [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ]
	//
	// [ 'one-header' => [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ], 
	//   'tvo-header' => [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ],
	// ]
	//
	if ( $key[ "head" ] && is_array( $key[ "head" ] ) ) {
	
		$table .= _build_test_array( $key[ "head" ], true );
		
	};
	
	// Тела ( array ( array ) ) 
	//
	// Например:
	//
	// ['1 колонка','','',''] колонка и три пустых
	// 
	// ['4 колонки',null,null,null]
	//
	// ['3 колонки',null,null,'1 колонка']
	//
	// [ ['4 колонки','','',''],  ['4 колонки','','',''] ]
	//
	// Или с классом:
	//
	// [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ]
	//
	// [ 'one-prod' => [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ], 
	//   'tvo-prod' => [ 'counter'=>'1 колонка','product'=>'3 колонки',null,null ],
	// ]
	//
	if ( $key[ "body" ] && is_array( $key[ "body" ] ) ) {
	
		$table .= _build_test_array( $key[ "body" ] );
		
	};
				
	$table .= '</table>';
	
	// После таблички ( string ) например '</div>'
	if ( $key[ "after" ] && is_string( $key[ "after" ] ) ) {
	
		$table .= $key[ "after" ];
		
	};
	
	return $table;
	
};	

?>


