{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"SimpleRNN","config":{"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"simple_rnn_SimpleRNN1","trainable":true,"batch_input_shape":[null,5,12],"dtype":"float32"}},{"class_name":"RepeatVector","config":{"n":3,"name":"repeat_vector_RepeatVector1","trainable":true}},{"class_name":"SimpleRNN","config":{"units":32,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"simple_rnn_SimpleRNN2","trainable":true}},{"class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":12,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},"name":"time_distributed_TimeDistributed1","trainable":true}},{"class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation1","trainable":true}}],"keras_version":"tfjs-layers 0.8.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./my-model-1.weights.bin"],"weights":[{"name":"simple_rnn_SimpleRNN1/kernel","shape":[12,32],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN1/recurrent_kernel","shape":[32,32],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN1/bias","shape":[32],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN2/kernel","shape":[32,32],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN2/recurrent_kernel","shape":[32,32],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN2/bias","shape":[32],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/kernel","shape":[32,12],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/bias","shape":[12],"dtype":"float32"}]}]}